In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")

In [3]:
df.head() # Baştan 5 satırı getirir

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail() # Sondan 5 satırı getirir.

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [6]:
#Satırlar arasında boş olanları temizlemek istersek bunu aşağıdaki gibi yapabiliriz. 
df.dropna(subset=["Age"],axis=0) # axis=0 ile boş olan satırların silinmesini sağlıyoruz. axis=1 dersek boş olan kolonu siler.

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df.loc[0,"Ticket"] # loc ile kolon adı ve satır numarası ile ilgili değeri getiririz.

'A/5 21171'

In [8]:
df.loc[0,"Fare"]

7.25

In [9]:
df.loc[1,"Ticket"]

'PC 17599'

In [10]:
df.iloc[0,7]

'A/5 21171'

<code>loc</code> ve <code>iloc</code> ile bir dataframe içerisinden slicing ile yeni bir dataframe yaratılabilir.

In [11]:
new_df_loc=df.loc[0:2,"Ticket":"Cabin"]

In [12]:
new_df_loc

             Ticket     Fare Cabin
0         A/5 21171   7.2500   NaN
1          PC 17599  71.2833   C85
2  STON/O2. 3101282   7.9250   NaN

In [13]:
new_df_iloc=df.iloc[5:7,3:9]

In [14]:
new_df_iloc

    Sex   Age  SibSp  Parch  Ticket     Fare
5  male   NaN      0      0  330877   8.4583
6  male  54.0      0      0   17463  51.8625

In [15]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df["Age"]>=25

0      False
1       True
2       True
3       True
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [17]:
new_df_up25=df[df["Age"]>=25] # sadece yaşı 25'e eşit ve büyük olan yolculardan oluşan bir veri seti oluşturduk.

In [18]:
new_df_up25.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,male,54.0,0,0,17463,51.8625,E46,S

In [19]:
df_gapminder=pd.read_csv("gapminder.csv")

In [20]:
df_gapminder.head()

   Unnamed: 0      country  year  population      cont  life_exp       gdp_cap
0          11  Afghanistan  2007  31889923.0      Asia    43.828    974.580338
1          23      Albania  2007   3600523.0    Europe    76.423   5937.029526
2          35      Algeria  2007  33333216.0    Africa    72.301   6223.367465
3          47       Angola  2007  12420476.0    Africa    42.731   4797.231267
4          59    Argentina  2007  40301927.0  Americas    75.320  12779.379640

In [21]:
df_gapminder["cont"]

0          Asia
1        Europe
2        Africa
3        Africa
4      Americas
         ...
137        Asia
138        Asia
139        Asia
140      Africa
141      Africa
Name: cont, Length: 142, dtype: object

In [22]:
# Bu kolonda kaç tane uniq değer olduğunu bulmak için unique metodunu kullanabiliriz.
df_gapminder["cont"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [23]:
# Read data from CSV file

csv_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

In [24]:
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [25]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

In [26]:
# Access to the column Length

x_df = df[['Length']]# İç içe iki köşeli parantez ile slicing yapılırsa dataframe oluşur.
x_df

     Length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33
5  00:43:08
6  01:15:54
7  00:40:01

In [27]:
x_sr = df['Length'] # Bu şekilde bir seri yaratılır
x_sr

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

In [28]:
print("x_df: ",type(x_df))
print("x_sr: ",type(x_sr))

x_df:  <class 'pandas.core.frame.DataFrame'>
x_sr:  <class 'pandas.core.series.Series'>

In [29]:
df[["Artist","Album","Genre"]]

,Artist,Album,Genre
0,Michael Jackson,Thriller,"pop, rock, R&B"
1,AC/DC,Back in Black,hard rock
2,Pink Floyd,The Dark Side of the Moon,progressive rock
3,Whitney Houston,The Bodyguard,"R&B, soul, pop"
4,Meat Loaf,Bat Out of Hell,"hard rock, progressive rock"
5,Eagles,Their Greatest Hits (1971-1975),"rock, soft rock, folk rock"
6,Bee Gees,Saturday Night Fever,disco
7,Fleetwood Mac,Rumours,soft rock

***Data Frame içerisine yeni kolon eklemek***

In [30]:
df_gap=pd.read_csv("gapminder.csv")

In [31]:
df_gap.head()

   Unnamed: 0      country  year  population      cont  life_exp       gdp_cap
0          11  Afghanistan  2007  31889923.0      Asia    43.828    974.580338
1          23      Albania  2007   3600523.0    Europe    76.423   5937.029526
2          35      Algeria  2007  33333216.0    Africa    72.301   6223.367465
3          47       Angola  2007  12420476.0    Africa    42.731   4797.231267
4          59    Argentina  2007  40301927.0  Americas    75.320  12779.379640

In [32]:
df_gap["test1"]=1

In [33]:
df_gap["test1"]=1+2

In [34]:
df_gap["test1"]=df_gap["population"]/100000

In [35]:
df_gap["test2"]=df_gap["gdp_cap"]/df_gap["population"]*10000

In [36]:
#Koşullu değerler ile yeni kolon ekleme
df_gap.loc[(df_gap["test2"]>3) & (df_gap["life_exp"]<76),"test3"]=1
df_gap.loc[(df_gap["test2"]<=3) | (df_gap["life_exp"]>=76),"test3"]=0

In [37]:
#Lambda fonsiyon ile kolon ekleme
df_gap["test4"]=df_gap.apply((lambda x:1 if x["test2"]>3 else 0),axis=1)

In [38]:
#df["Direction"]=df.apply(lambda x: 1 if (abs(x["CLOSE"]-x["OPEN"])>=0.100) & ((x["CLOSE"]-x["OPEN"])>0) else (-1 if (abs(x["CLOSE"]-x["OPEN"])>=0.100) & ((x["CLOSE"]-x["OPEN"])<0) else 0), axis=1 )

In [39]:
#Lambda ile daha karmaşık bir fonksiyon için iç içe if kullarak kolon ekleme
df_gap['test5'] = df_gap.apply(lambda x: 1 if (x["test2"]>3) & (x["life_exp"]<76) else (2 if (x["test2"]>3) & (x["life_exp"]>=76) else 0),axis=1)

In [40]:
df_gap['test6'] = df_gap.apply(lambda x: 1 if (abs(x["test2"]-x["test3"])>3) & (x["life_exp"]<76) else (2 if (abs(x["test2"]-x["test3"]>3)) & (x["life_exp"]>=76) else 0),axis=1)

In [41]:
df_gap.head()

,Unnamed: 0,country,year,population,cont,life_exp,gdp_cap,test1,test2,test3,test4,test5,test6
0,11,Afghanistan,2007,31889923.0,Asia,43.828,974.580338,318.89923,0.305608,0.0,0,0,0
1,23,Albania,2007,3600523.0,Europe,76.423,5937.029526,36.00523,16.489353,0.0,1,2,2
2,35,Algeria,2007,33333216.0,Africa,72.301,6223.367465,333.33216,1.867017,0.0,0,0,0
3,47,Angola,2007,12420476.0,Africa,42.731,4797.231267,124.20476,3.862357,1.0,1,1,0
4,59,Argentina,2007,40301927.0,Americas,75.320,12779.379640,403.01927,3.170910,1.0,1,1,0

***null verileri temizlemek***

In [42]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'age': [5, 6, np.NaN],
                   'born': [pd.NaT, pd.Timestamp('1939-05-27'),
                            pd.Timestamp('1940-04-25')],
                   'name': ['Alfred', 'Batman', ''],
                   'toy': [None, 'Batmobile', 'Joker']})

In [43]:
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  NaN 1940-04-25              Joker

In [44]:
df["age"]=df["age"].mask(pd.isnull,7) # Eğer kolon içerisinde null değer var ise 7 yazacak

In [45]:
df

   age       born    name        toy
0  5.0        NaT  Alfred       None
1  6.0 1939-05-27  Batman  Batmobile
2  7.0 1940-04-25              Joker

***Kolon adlarını değiştirmek***

In [46]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})

In [47]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [48]:
df=df.rename(columns={"A":"col1","B":"col2"})

In [49]:
df

   col1  col2
0     1     4
1     2     5
2     3     6

***Kolon silmek***

In [50]:
df=df.drop(columns=["col2"])

In [51]:
df

   col1
0     1
1     2
2     3

***Veri tipini değiştirmek***

In [52]:
pd.to_datetime('20071001', format='%Y%m%d', errors='ignore')

Timestamp('2007-10-01 00:00:00')

In [54]:
#df['Timestamp'] = df["Timestamp"].astype(np.int64)// 10 ** 9 # Unix style timestamp haline getirdim.

***Substring***

In [55]:
s = pd.Series(["koala", "fox", "chameleon"])
s

0        koala
1          fox
2    chameleon
dtype: object

In [56]:
s.str.slice(start=1)

0        oala
1          ox
2    hameleon
dtype: object

In [57]:
s.str.slice(start=0, stop=5, step=3)

0    kl
1     f
2    cm
dtype: object

In [58]:
s.str[0:5:3]

0    kl
1     f
2    cm
dtype: object

***İki dataframe'i join yapmak***

In [59]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                      'A': ['A0', 'A1', 'A2', 'A3'],
   ....:                      'B': ['B0', 'B1', 'B2', 'B3']})

In [60]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K5', 'K3'],
   ....:                       'C': ['C0', 'C1', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D1', 'D2', 'D3']})

In [61]:
result = pd.merge(left, right, on='key',how="left") # "https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html"

In [62]:
result

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3

# Data Normalization

Bunun için temelde 3 yöntem var. 

* Simple Feature Scailing => Xnew=Xold/Xmax
* Min - Max => Xnew=(Xold-Xmin)/(Xmax-Xmin)
* Z-score => Xnew=(Xold-Xmean)/Xstd

In [74]:
df_tn=df_gap[['country','gdp_cap']]

In [78]:
df_tn.head()

       country       gdp_cap       SFS
0  Afghanistan    974.580338  0.019745
1      Albania   5937.029526  0.120287
2      Algeria   6223.367465  0.126088
3       Angola   4797.231267  0.097194
4    Argentina  12779.379640  0.258916

In [81]:
df_tn.tail()

                country      gdp_cap       SFS   min_max
137             Vietnam  2441.576404  0.049467  0.044092
138  West Bank and Gaza  3025.349798  0.061295  0.055987
139         Yemen, Rep.  2280.769906  0.046209  0.040816
140              Zambia  1271.211593  0.025755  0.020246
141            Zimbabwe   469.709298  0.009517  0.003915

In [84]:
df_tn.describe()

            gdp_cap         SFS     min_max       z-score
count    142.000000  142.000000  142.000000  1.420000e+02
mean   11680.071820    0.236644    0.232327  1.250956e-16
std    12859.937337    0.260548    0.262022  1.000000e+00
min      277.551859    0.005623    0.000000 -8.866699e-01
25%     1624.842248    0.032920    0.027451 -7.819035e-01
50%     6124.371109    0.124083    0.119129 -4.320162e-01
75%    18008.835640    0.364868    0.361276  4.921302e-01
max    49357.190170    1.000000    1.000000  2.929806e+00

In [76]:
df_tn["SFS"]=df_tn['gdp_cap']/df_tn['gdp_cap'].max() #Simple Feature Scailing

C:\Users\evren\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [82]:
df_tn["min_max"]=(df_tn["gdp_cap"]-df_tn["gdp_cap"].min())/(df_tn["gdp_cap"].max()-df_tn["gdp_cap"].min()) #Min - Max

C:\Users\evren\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [90]:
df_tn["z-score"]=(df_tn["gdp_cap"]-df_tn["gdp_cap"].mean())/df_tn["gdp_cap"].std()

C:\Users\evren\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [85]:
df_tn.describe()

            gdp_cap         SFS     min_max       z-score
count    142.000000  142.000000  142.000000  1.420000e+02
mean   11680.071820    0.236644    0.232327  1.250956e-16
std    12859.937337    0.260548    0.262022  1.000000e+00
min      277.551859    0.005623    0.000000 -8.866699e-01
25%     1624.842248    0.032920    0.027451 -7.819035e-01
50%     6124.371109    0.124083    0.119129 -4.320162e-01
75%    18008.835640    0.364868    0.361276  4.921302e-01
max    49357.190170    1.000000    1.000000  2.929806e+00

In [86]:
df_tn.head(10)

       country       gdp_cap       SFS   min_max   z-score
0  Afghanistan    974.580338  0.019745  0.014202 -0.832468
1      Albania   5937.029526  0.120287  0.115312 -0.446584
2      Algeria   6223.367465  0.126088  0.121146 -0.424318
3       Angola   4797.231267  0.097194  0.092089 -0.535216
4    Argentina  12779.379640  0.258916  0.254725  0.085483
5    Australia  34435.367440  0.697677  0.695967  1.769472
6      Austria  36126.492700  0.731940  0.730424  1.900975
7      Bahrain  29796.048340  0.603682  0.601441  1.408714
8   Bangladesh   1391.253792  0.028187  0.022692 -0.800068
9      Belgium  33692.605080  0.682628  0.680833  1.711714

***Binning in Python Pandas***

In [95]:
bins=np.linspace(min(df_tn["gdp_cap"]),max(df_tn["gdp_cap"]),4)

In [114]:
print(bins)

[  277.5518587 16637.4312958 32997.3107329 49357.19017  ]

In [96]:
group_names=["Low","Medium","High"]

In [97]:
df_tn["gdp_cap_binned"]=pd.cut(df_tn["gdp_cap"],bins,labels=group_names,include_lowest=True)

C:\Users\evren\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [99]:
df_tn.head(10)

       country       gdp_cap       SFS   min_max   z-score gdp_cap_binned
0  Afghanistan    974.580338  0.019745  0.014202 -0.832468            Low
1      Albania   5937.029526  0.120287  0.115312 -0.446584            Low
2      Algeria   6223.367465  0.126088  0.121146 -0.424318            Low
3       Angola   4797.231267  0.097194  0.092089 -0.535216            Low
4    Argentina  12779.379640  0.258916  0.254725  0.085483            Low
5    Australia  34435.367440  0.697677  0.695967  1.769472           High
6      Austria  36126.492700  0.731940  0.730424  1.900975           High
7      Bahrain  29796.048340  0.603682  0.601441  1.408714         Medium
8   Bangladesh   1391.253792  0.028187  0.022692 -0.800068            Low
9      Belgium  33692.605080  0.682628  0.680833  1.711714           High

***Kategorik verilerin sayısal verilere çevrilmesi***

Kategorik veriler kolon haline getirilip  o satırlarda 1-0 değerleri koyararak sayısallaştırmaya ***One Hot Encoding*** denir. Bunun için <code>pd.get_dummies()</code> metodu kullanılır. 

![](One-Hot-Encoding.png)

In [105]:
df_bin=pd.get_dummies(df_tn["gdp_cap_binned"],prefix="bin")

In [106]:
df_tn=df_tn.join(df_bin)

In [112]:
df_tn=df_tn.drop(columns=["gdp_cap_binned"])

In [113]:
df_tn.head(10)

,country,gdp_cap,SFS,min_max,z-score,bin_Low,bin_Medium,bin_High
0,Afghanistan,974.580338,0.019745,0.014202,-0.832468,1,0,0
1,Albania,5937.029526,0.120287,0.115312,-0.446584,1,0,0
2,Algeria,6223.367465,0.126088,0.121146,-0.424318,1,0,0
3,Angola,4797.231267,0.097194,0.092089,-0.535216,1,0,0
4,Argentina,12779.379640,0.258916,0.254725,0.085483,1,0,0
5,Australia,34435.367440,0.697677,0.695967,1.769472,0,0,1
6,Austria,36126.492700,0.731940,0.730424,1.900975,0,0,1
7,Bahrain,29796.048340,0.603682,0.601441,1.408714,0,1,0
8,Bangladesh,1391.253792,0.028187,0.022692,-0.800068,1,0,0
9,Belgium,33692.605080,0.682628,0.680833,1.711714,0,0,1